000020 IDENTIFICATION DIVISION.
000030 PROGRAM-ID.   TEST-MAIN.
000148*--------------------------------------------------------------
000040 ENVIRONMENT    DIVISION.
000138 INPUT-OUTPUT               SECTION.
000148*--------------------------------------------------------------
000158*- IN :仮想マシンコードが記述されたファイル
000158*- ASSIGN TO "DD名"
000158*- プログラム実行時の環境変数に"DD_DD名"を定義しておくと、
000158*- その環境変数で指定されたファイルパスを見に行く。
000168*--------------------------------------------------------------
000139 FILE-CONTROL.
000140   SELECT FVCODE ASSIGN TO "FVCODE"
000141   ORGANIZATION IS LINE SEQUENTIAL
000142   STATUS FVCODE-FST.
000148*--------------------------------------------------------------
000143 DATA DIVISION.
000144 FILE                       SECTION.
000148*--------------------------------------------------------------
000158*- 仮想マシンコードが記述されたファイル
000168*--------------------------------------------------------------
000145 FD  FVCODE.
000146 01  FVCODE-REC             PIC X(18).
000147 WORKING-STORAGE SECTION.
000148*--------------------------------------------------------------
000158*- その他ワーク
000168*--------------------------------------------------------------
000178 01  FVCODE-FST              PIC X(02).
000186*--------------------------------------------------------------
000187*- 仮想コードモジュールCALLパラーメータ。
000188*--------------------------------------------------------------
000189 01       PVCODE-PRM.
000201   COPY   RVCODE-PRM.
000207*--------------------------------------------------------------
000208*- IN1のつもり
000209*--------------------------------------------------------------
000210 01       IN100             SYNC.
000211   03     FILLER            PIC X(10) VALUE '123456789 '.
000217*--------------------------------------------------------------
000218*- IN2のつもり
000219*--------------------------------------------------------------
000220 01       IN200             SYNC.
000221   03     FILLER            PIC X(10) VALUE '123456789 '.
000227*--------------------------------------------------------------
000228*- IN3のつもり
000229*--------------------------------------------------------------
000230 01       IN300             SYNC.
000231   03     FILLER            PIC X(10) VALUE '123456789 '.
000232*--------------------------------------------------------------
000233*- OUTのつもり
000234*--------------------------------------------------------------
000235 01       OUT00             SYNC.
000236   03     FILLER            PIC X(100).
000237 PROCEDURE DIVISION.   
000238 A00-MAIN SECTION.
000239*--------------------------------------------------------------
000240*-
000241*--------------------------------------------------------------
000242 A00-010.
000243   MOVE SPACE         TO PVCODE-PRM.
000244   MOVE 'INIT'        TO PVCODE-FUNC.
000245   CALL 'SUBVCODE' USING PVCODE-PRM
000246                         IN100
000247                         IN200
000248                         IN300
000249                         OUT00.
000250*- FILE READ
000559   OPEN  INPUT  FVCODE.
      *-  DISPLAY 'FVCODE-FST:' FVCODE-FST.
000560   PERFORM UNTIL FVCODE-FST NOT = '00'
000561     READ FVCODE
000562       END
000563         CONTINUE
000564       NOT END
000566         MOVE SPACE         TO PVCODE-PRM
000567         MOVE 'LOAD'        TO PVCODE-FUNC
000568         MOVE FVCODE-REC    TO PVCODE
000569         CALL 'SUBVCODE' USING PVCODE-PRM
000570                               IN100
000571                               IN200
000572                               IN300
000573                               OUT00
000574     END-READ
000575   END-PERFORM.
000576   CLOSE FVCODE.
000577   MOVE SPACE         TO PVCODE-PRM.
000578   MOVE 'EXEC'        TO PVCODE-FUNC.
000579   CALL 'SUBVCODE' USING PVCODE-PRM
000580                         IN100
000581                         IN200
000582                         IN300
000583                         OUT00.
000584   DISPLAY 'RES:(' OUT00 ')'.
000585*-DEBUG:
000586   MOVE 'DUMP'        TO PVCODE-FUNC.
000587   CALL 'SUBVCODE' USING PVCODE-PRM
000588                         IN100
000589                         IN200
000590                         IN300
000591                         OUT00.
000592 A00-EXIT.
000593   MOVE ZERO TO RETURN-CODE.
000594   GOBACK.
000600
